Revit 2026 API

# IFCExportOptions(IFCExportOptions) Constructor

---

Creates a copy of an IFCExportOptions.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IFCExportOptions(
	IFCExportOptions from
)
```
```vb
Public Sub New (
	from As IFCExportOptions
)
```
```cpp
public:
IFCExportOptions(
	IFCExportOptions^ from
)
```
```fsharp
new :
        from : IFCExportOptions -> IFCExportOptions
```

#### Parameters

from IFCExportOptions

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

IFCExportOptions Class

IFCExportOptions Overload

Autodesk.Revit.DB Namespace